*** meow/src/keyboard.rs:4:5: replace logged_out_operations -> InlineKeyboardMarkup with Default::default()

*** mutation diff:
--- meow/src/keyboard.rs
+++ replace logged_out_operations -> InlineKeyboardMarkup with Default::default()
@@ -1,25 +1,12 @@
 use teloxide::types::{InlineKeyboardButton, InlineKeyboardMarkup};
 
 pub fn logged_out_operations() -> InlineKeyboardMarkup {
-    let operations = [("Sign Up", "Sign Up"), ("Log In", "Log In"), ("FAQ", "FAQ")];
-    let mut keyboard: Vec<Vec<InlineKeyboardButton>> = vec![];
-
-    for row in operations.chunks(3) {
-        keyboard.push(
-            row.iter()
-                .map(|&(text, data)| {
-                    InlineKeyboardButton::callback(text.to_owned(), data.to_owned())
-                })
-                .collect(),
-        );
-    }
-
-    InlineKeyboardMarkup::new(keyboard)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn logged_in_operations() -> InlineKeyboardMarkup {
     let operations = [
         ("List", "List"),
         ("Trade", "Trade"),
         ("Create", "Create"),
         ("Log Out", "Log Out"),

---- keyboard::tests::test_logged_out_operations_not_default stdout ----

thread 'keyboard::tests::test_logged_out_operations_not_default' panicked at meow/src/keyboard.rs:40:9:
logged_out_operations should not return an empty keyboard

---- keyboard::tests::test_logged_out_operations_structure stdout ----

thread 'keyboard::tests::test_logged_out_operations_structure' panicked at meow/src/keyboard.rs:59:9:
assertion `left == right` failed: Should have 1 row
  left: 0
 right: 1

failures:
    keyboard::tests::test_logged_out_operations_not_default
    keyboard::tests::test_logged_out_operations_structure

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
