*** meow/src/main.rs:20:5: replace is_enclave_mode -> bool with false

*** mutation diff:
--- meow/src/main.rs
+++ replace is_enclave_mode -> bool with false
@@ -12,17 +12,17 @@
 // Constants
 const DEFAULT_DATABASE_PATH: &str = "purrbot.sqlite";
 const DEFAULT_TCP_ADDRESS: &str = "127.0.0.1:5005";
 const ENCLAVE_MODE_ENV_VAR: &str = "ENCLAVE_MODE";
 const ENCLAVE_MODE_VALUE: &str = "enclave";
 
 // Helper functions
 fn is_enclave_mode() -> bool {
-    std::env::var(ENCLAVE_MODE_ENV_VAR).as_deref() == Ok(ENCLAVE_MODE_VALUE)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn create_tcp_transport(address: &str) -> Transport {
     match address.parse() {
         Ok(addr) => Transport::Tcp(addr),
         Err(_) => panic!("Invalid TCP address"),
     }
 }

---- tests::test_is_enclave_mode stdout ----

thread 'tests::test_is_enclave_mode' panicked at meow/src/main.rs:115:9:
assertion failed: is_enclave_mode()

failures:
    tests::test_is_enclave_mode

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
