*** meow/src/v1/models/buttons.rs:36:17: delete match arm

*** mutation diff:
--- meow/src/v1/models/buttons.rs
+++ delete match arm
@@ -28,17 +28,17 @@
 }
 
 impl Button {
     pub fn from_str(input: &str, is_logged_in: bool) -> Self {
         if is_logged_in {
             match input {
                 "List" => Self::List,
                 "Trade" => Self::Trade,
-                "Create" => Self::Create,
+                 /* ~ changed by cargo-mutants ~ */
                 "Log Out" => Self::LogOut,
                 "Print Keys" => Self::PrintKeys,
                 _ => Self::UnRecognized,
             }
         } else {
             match input {
                 "Log In" => Self::LogIn,
                 "Sign Up" => Self::SignUp,

---- v1::models::buttons::test_parse_logged_in_button_all_arms_required stdout ----

thread 'v1::models::buttons::test_parse_logged_in_button_all_arms_required' panicked at meow/src/v1/models/buttons.rs:256:9:
assertion `left == right` failed: Button::from_str('Create', true) should return Create, but got UnRecognized
  left: UnRecognized
 right: Create

failures:
    v1::models::buttons::test_parse_logged_in_button_all_arms_required

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
