*** meow/src/v1/models/buttons.rs:37:17: delete match arm

*** mutation diff:
--- meow/src/v1/models/buttons.rs
+++ delete match arm
@@ -29,17 +29,17 @@
 
 impl Button {
     pub fn from_str(input: &str, is_logged_in: bool) -> Self {
         if is_logged_in {
             match input {
                 "List" => Self::List,
                 "Trade" => Self::Trade,
                 "Create" => Self::Create,
-                "Log Out" => Self::LogOut,
+                 /* ~ changed by cargo-mutants ~ */
                 "Print Keys" => Self::PrintKeys,
                 _ => Self::UnRecognized,
             }
         } else {
             match input {
                 "Log In" => Self::LogIn,
                 "Sign Up" => Self::SignUp,
                 "FAQ" => Self::Faq,

---- v1::models::buttons::test_parse_logged_in_button_all_arms_required stdout ----

thread 'v1::models::buttons::test_parse_logged_in_button_all_arms_required' panicked at meow/src/v1/models/buttons.rs:256:9:
assertion `left == right` failed: Button::from_str('Log Out', true) should return LogOut, but got UnRecognized
  left: UnRecognized
 right: LogOut

failures:
    v1::models::buttons::test_parse_logged_in_button_all_arms_required

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
