*** meow/src/v1/models/buttons.rs:43:17: delete match arm

*** mutation diff:
--- meow/src/v1/models/buttons.rs
+++ delete match arm
@@ -35,17 +35,17 @@
                 "Trade" => Self::Trade,
                 "Create" => Self::Create,
                 "Log Out" => Self::LogOut,
                 "Print Keys" => Self::PrintKeys,
                 _ => Self::UnRecognized,
             }
         } else {
             match input {
-                "Log In" => Self::LogIn,
+                 /* ~ changed by cargo-mutants ~ */
                 "Sign Up" => Self::SignUp,
                 "FAQ" => Self::Faq,
                 _ => Self::UnRecognized,
             }
         }
     }
 
     pub async fn execute(

---- v1::models::buttons::test_parse_logged_out_button_all_arms_required stdout ----

thread 'v1::models::buttons::test_parse_logged_out_button_all_arms_required' panicked at meow/src/v1/models/buttons.rs:314:9:
assertion `left == right` failed: Button::from_str('Log In', false) should return LogIn, but got UnRecognized
  left: UnRecognized
 right: LogIn

failures:
    v1::models::buttons::test_parse_logged_out_button_all_arms_required

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
