*** meow/src/v1/models/buttons.rs:44:17: delete match arm

*** mutation diff:
--- meow/src/v1/models/buttons.rs
+++ delete match arm
@@ -36,17 +36,17 @@
                 "Create" => Self::Create,
                 "Log Out" => Self::LogOut,
                 "Print Keys" => Self::PrintKeys,
                 _ => Self::UnRecognized,
             }
         } else {
             match input {
                 "Log In" => Self::LogIn,
-                "Sign Up" => Self::SignUp,
+                 /* ~ changed by cargo-mutants ~ */
                 "FAQ" => Self::Faq,
                 _ => Self::UnRecognized,
             }
         }
     }
 
     pub async fn execute(
         &self,

---- v1::models::buttons::test_parse_logged_out_button_all_arms_required stdout ----

thread 'v1::models::buttons::test_parse_logged_out_button_all_arms_required' panicked at meow/src/v1/models/buttons.rs:314:9:
assertion `left == right` failed: Button::from_str('Sign Up', false) should return SignUp, but got UnRecognized
  left: UnRecognized
 right: SignUp

failures:
    v1::models::buttons::test_parse_logged_out_button_all_arms_required

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
