*** 9sdk/src/lib.rs:120:9: replace KeyManager::set_config with ()

*** mutation diff:
--- 9sdk/src/lib.rs
+++ replace KeyManager::set_config with ()
@@ -112,18 +112,17 @@
         // Derive keys
         let key1 = derive_key(password, &salt1)?;
         let key2 = derive_key(password, &salt2)?;
 
         Ok((key1, key2))
     }
 
     pub fn set_config(&self, config: EncryptedKeyConfig) {
-        let mut guard = self.config.lock().unwrap();
-        *guard = Some(config);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Hashes a password using Argon2
 fn hash_password(password: &str) -> Result<String, KeyManagerError> {
     let mut rng = thread_rng();
     let salt = SaltString::generate(&mut rng);
     let argon2 = Argon2::default();

*** result: Success
