*** meow/src/keyboard.rs:21:5: replace logged_in_operations -> InlineKeyboardMarkup with Default::default()

*** mutation diff:
--- meow/src/keyboard.rs
+++ replace logged_in_operations -> InlineKeyboardMarkup with Default::default()
@@ -13,36 +13,17 @@
                 .collect(),
         );
     }
 
     InlineKeyboardMarkup::new(keyboard)
 }
 
 pub fn logged_in_operations() -> InlineKeyboardMarkup {
-    let operations = [
-        ("List", "List"),
-        ("Trade", "Trade"),
-        ("Create", "Create"),
-        ("Log Out", "Log Out"),
-        ("Print Keys", "Print Keys"),
-    ];
-    let mut keyboard: Vec<Vec<InlineKeyboardButton>> = vec![];
-
-    for row in operations.chunks(3) {
-        keyboard.push(
-            row.iter()
-                .map(|&(text, data)| {
-                    InlineKeyboardButton::callback(text.to_owned(), data.to_owned())
-                })
-                .collect(),
-        );
-    }
-
-    InlineKeyboardMarkup::new(keyboard)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_logged_out_operations_not_default() {

---- keyboard::tests::test_logged_in_operations_not_default stdout ----

thread 'keyboard::tests::test_logged_in_operations_not_default' panicked at meow/src/keyboard.rs:44:9:
logged_in_operations should not return an empty keyboard

---- keyboard::tests::test_logged_in_operations_structure stdout ----

thread 'keyboard::tests::test_logged_in_operations_structure' panicked at meow/src/keyboard.rs:68:9:
assertion `left == right` failed: Should have 2 rows
  left: 0
 right: 2

failures:
    keyboard::tests::test_logged_in_operations_not_default
    keyboard::tests::test_logged_in_operations_structure

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
