*** meow/src/v1/handlers/callback.rs:40:5: replace log_callback_result with ()

*** mutation diff:
--- meow/src/v1/handlers/callback.rs
+++ replace log_callback_result with ()
@@ -32,20 +32,17 @@
         Ok(_) => log::info!("Callback processing completed successfully"),
         Err(e) => log::error!("Callback processing failed: {}", e),
     }
 
     result
 }
 
 fn log_callback_result<T, E: std::fmt::Display>(result: &Result<T, E>) {
-    match result {
-        Ok(_) => log::info!("Callback processed successfully"),
-        Err(error) => log::error!("Callback processing failed: {}", error),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use teloxide::types::{CallbackQuery, User, UserId};
     
     // Helper function to create a test user

*** result: Success
