*** meow/src/v1/services/user_config_store.rs:100:5: replace query_user_config -> Result<String, UserConfigStoreError> with Ok("xyzzy".into())

*** mutation diff:
--- meow/src/v1/services/user_config_store.rs
+++ replace query_user_config -> Result<String, UserConfigStoreError> with Ok("xyzzy".into())
@@ -92,21 +92,17 @@
     connection.execute(INSERT_OR_UPDATE_SQL, params![user_id, config_json])?;
     Ok(())
 }
 
 fn query_user_config(
     connection: &Connection,
     user_id: &str,
 ) -> Result<String, UserConfigStoreError> {
-    let config_json: Option<String> = connection
-        .query_row(SELECT_CONFIG_SQL, params![user_id], |row| row.get(0))
-        .optional()?;
-    
-    config_json.ok_or(UserConfigStoreError::NotFound)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use tempfile::TempDir;
     
     // Test constants

---- v1::services::user_config_store::tests::test_get_config_not_found stdout ----

thread 'v1::services::user_config_store::tests::test_get_config_not_found' panicked at meow/src/v1/services/user_config_store.rs:214:9:
assertion failed: matches!(result, Err(UserConfigStoreError::NotFound))

---- v1::services::user_config_store::tests::test_config_exists stdout ----

thread 'v1::services::user_config_store::tests::test_config_exists' panicked at meow/src/v1/services/user_config_store.rs:253:9:
assertion `left == right` failed
  left: true
 right: false

---- v1::services::user_config_store::tests::test_insert_and_get_config stdout ----

thread 'v1::services::user_config_store::tests::test_insert_and_get_config' panicked at meow/src/v1/services/user_config_store.rs:205:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "{\"password_hash\":\"test_hash\",\"primary_key_salt\":\"test_salt1\",\"secondary_key_salt\":\"test_salt2\"}"

failures:
    v1::services::user_config_store::tests::test_concurrent_access
    v1::services::user_config_store::tests::test_config_exists
    v1::services::user_config_store::tests::test_empty_config_json
    v1::services::user_config_store::tests::test_get_config_not_found
    v1::services::user_config_store::tests::test_helper_functions
    v1::services::user_config_store::tests::test_insert_and_get_config
    v1::services::user_config_store::tests::test_large_config_json
    v1::services::user_config_store::tests::test_multiple_users
    v1::services::user_config_store::tests::test_special_characters_in_user_id
    v1::services::user_config_store::tests::test_sql_injection_safety
    v1::services::user_config_store::tests::test_update_existing_config
    v1::services::user_config_store::tests::test_very_long_user_id

test result: FAILED. 31 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
