*** meow/src/v1/services/user_config_store.rs:55:9: replace UserConfigStore::insert_or_update_config -> Result<(), UserConfigStoreError> with Ok(())

*** mutation diff:
--- meow/src/v1/services/user_config_store.rs
+++ replace UserConfigStore::insert_or_update_config -> Result<(), UserConfigStoreError> with Ok(())
@@ -47,19 +47,17 @@
     }
 
     /// Stores or updates a user's configuration
     pub async fn insert_or_update_config(
         &self,
         user_id: &str,
         config_json: &str,
     ) -> Result<(), UserConfigStoreError> {
-        let connection = self.connection.lock().await;
-        execute_insert_or_update(&*connection, user_id, config_json)?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Retrieves a user's configuration
     pub async fn get_config(&self, user_id: &str) -> Result<String, UserConfigStoreError> {
         let connection = self.connection.lock().await;
         query_user_config(&*connection, user_id)
     }

---- v1::services::user_config_store::tests::test_empty_config_json stdout ----

thread 'v1::services::user_config_store::tests::test_empty_config_json' panicked at meow/src/v1/services/user_config_store.rs:272:62:
called `Result::unwrap()` on an `Err` value: NotFound

---- v1::services::user_config_store::tests::test_config_exists stdout ----

thread 'v1::services::user_config_store::tests::test_config_exists' panicked at meow/src/v1/services/user_config_store.rs:261:9:
assertion `left == right` failed
  left: false
 right: true

---- v1::services::user_config_store::tests::test_insert_and_get_config stdout ----

thread 'v1::services::user_config_store::tests::test_insert_and_get_config' panicked at meow/src/v1/services/user_config_store.rs:206:69:
called `Result::unwrap()` on an `Err` value: NotFound

failures:
    v1::services::user_config_store::tests::test_concurrent_access
    v1::services::user_config_store::tests::test_config_exists
    v1::services::user_config_store::tests::test_empty_config_json
    v1::services::user_config_store::tests::test_insert_and_get_config
    v1::services::user_config_store::tests::test_large_config_json
    v1::services::user_config_store::tests::test_multiple_users
    v1::services::user_config_store::tests::test_special_characters_in_user_id
    v1::services::user_config_store::tests::test_sql_injection_safety
    v1::services::user_config_store::tests::test_update_existing_config
    v1::services::user_config_store::tests::test_very_long_user_id

test result: FAILED. 33 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
