*** meow/src/v1/services/user_config_store.rs:62:9: replace UserConfigStore::get_config -> Result<String, UserConfigStoreError> with Ok(String::new())

*** mutation diff:
--- meow/src/v1/services/user_config_store.rs
+++ replace UserConfigStore::get_config -> Result<String, UserConfigStoreError> with Ok(String::new())
@@ -54,18 +54,17 @@
     ) -> Result<(), UserConfigStoreError> {
         let connection = self.connection.lock().await;
         execute_insert_or_update(&*connection, user_id, config_json)?;
         Ok(())
     }
 
     /// Retrieves a user's configuration
     pub async fn get_config(&self, user_id: &str) -> Result<String, UserConfigStoreError> {
-        let connection = self.connection.lock().await;
-        query_user_config(&*connection, user_id)
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
     
     /// Checks if a user configuration exists
     pub async fn config_exists(&self, user_id: &str) -> Result<bool, UserConfigStoreError> {
         match self.get_config(user_id).await {
             Ok(_) => Ok(true),
             Err(UserConfigStoreError::NotFound) => Ok(false),
             Err(e) => Err(e),

---- v1::services::user_config_store::tests::test_get_config_not_found stdout ----

thread 'v1::services::user_config_store::tests::test_get_config_not_found' panicked at meow/src/v1/services/user_config_store.rs:217:9:
assertion failed: matches!(result, Err(UserConfigStoreError::NotFound))

---- v1::services::user_config_store::tests::test_config_exists stdout ----

thread 'v1::services::user_config_store::tests::test_config_exists' panicked at meow/src/v1/services/user_config_store.rs:256:9:
assertion `left == right` failed
  left: true
 right: false

---- v1::services::user_config_store::tests::test_empty_config_json stdout ----

thread 'v1::services::user_config_store::tests::test_empty_config_json' panicked at meow/src/v1/services/user_config_store.rs:274:9:
assertion `left == right` failed
  left: ""
 right: "{}"

failures:
    v1::services::user_config_store::tests::test_concurrent_access
    v1::services::user_config_store::tests::test_config_exists
    v1::services::user_config_store::tests::test_empty_config_json
    v1::services::user_config_store::tests::test_get_config_not_found
    v1::services::user_config_store::tests::test_insert_and_get_config
    v1::services::user_config_store::tests::test_large_config_json
    v1::services::user_config_store::tests::test_multiple_users
    v1::services::user_config_store::tests::test_special_characters_in_user_id
    v1::services::user_config_store::tests::test_sql_injection_safety
    v1::services::user_config_store::tests::test_update_existing_config
    v1::services::user_config_store::tests::test_very_long_user_id

test result: FAILED. 32 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
