*** meow/src/v1/services/user_config_store.rs:68:9: replace UserConfigStore::config_exists -> Result<bool, UserConfigStoreError> with Ok(false)

*** mutation diff:
--- meow/src/v1/services/user_config_store.rs
+++ replace UserConfigStore::config_exists -> Result<bool, UserConfigStoreError> with Ok(false)
@@ -60,21 +60,17 @@
     /// Retrieves a user's configuration
     pub async fn get_config(&self, user_id: &str) -> Result<String, UserConfigStoreError> {
         let connection = self.connection.lock().await;
         query_user_config(&*connection, user_id)
     }
     
     /// Checks if a user configuration exists
     pub async fn config_exists(&self, user_id: &str) -> Result<bool, UserConfigStoreError> {
-        match self.get_config(user_id).await {
-            Ok(_) => Ok(true),
-            Err(UserConfigStoreError::NotFound) => Ok(false),
-            Err(e) => Err(e),
-        }
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // Database operation helpers
 
 fn open_database<P: AsRef<Path>>(path: P) -> Result<Connection, rusqlite::Error> {
     Connection::open(path)
 }

---- v1::services::user_config_store::tests::test_config_exists stdout ----

thread 'v1::services::user_config_store::tests::test_config_exists' panicked at meow/src/v1/services/user_config_store.rs:259:9:
assertion `left == right` failed
  left: false
 right: true

failures:
    v1::services::user_config_store::tests::test_config_exists

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
