*** meow/src/v1/services/user_config_store.rs:83:5: replace initialize_database_schema -> Result<(), rusqlite::Error> with Ok(())

*** mutation diff:
--- meow/src/v1/services/user_config_store.rs
+++ replace initialize_database_schema -> Result<(), rusqlite::Error> with Ok(())
@@ -75,18 +75,17 @@
 
 // Database operation helpers
 
 fn open_database<P: AsRef<Path>>(path: P) -> Result<Connection, rusqlite::Error> {
     Connection::open(path)
 }
 
 fn initialize_database_schema(connection: &Connection) -> Result<(), rusqlite::Error> {
-    connection.execute(CREATE_TABLE_SQL, [])?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn execute_insert_or_update(
     connection: &Connection,
     user_id: &str,
     config_json: &str,
 ) -> Result<(), rusqlite::Error> {
     connection.execute(INSERT_OR_UPDATE_SQL, params![user_id, config_json])?;

---- tests::test_is_enclave_mode stdout ----

thread 'tests::test_is_enclave_mode' panicked at meow/src/main.rs:119:9:
assertion failed: !is_enclave_mode()

---- v1::services::user_config_store::tests::test_helper_functions stdout ----

thread 'v1::services::user_config_store::tests::test_helper_functions' panicked at meow/src/v1/services/user_config_store.rs:362:9:
assertion failed: execute_insert_or_update(&conn, TEST_USER_ID, TEST_CONFIG_JSON).is_ok()

---- v1::services::user_config_store::tests::test_get_config_not_found stdout ----

thread 'v1::services::user_config_store::tests::test_get_config_not_found' panicked at meow/src/v1/services/user_config_store.rs:217:9:
assertion failed: matches!(result, Err(UserConfigStoreError::NotFound))

failures:
    tests::test_is_enclave_mode
    v1::services::user_config_store::tests::test_concurrent_access
    v1::services::user_config_store::tests::test_config_exists
    v1::services::user_config_store::tests::test_empty_config_json
    v1::services::user_config_store::tests::test_get_config_not_found
    v1::services::user_config_store::tests::test_helper_functions
    v1::services::user_config_store::tests::test_insert_and_get_config
    v1::services::user_config_store::tests::test_large_config_json
    v1::services::user_config_store::tests::test_multiple_users
    v1::services::user_config_store::tests::test_special_characters_in_user_id
    v1::services::user_config_store::tests::test_sql_injection_safety
    v1::services::user_config_store::tests::test_update_existing_config

test result: FAILED. 30 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
