*** meow/src/v1/services/user_config_store.rs:92:5: replace execute_insert_or_update -> Result<(), rusqlite::Error> with Ok(())

*** mutation diff:
--- meow/src/v1/services/user_config_store.rs
+++ replace execute_insert_or_update -> Result<(), rusqlite::Error> with Ok(())
@@ -84,18 +84,17 @@
     Ok(())
 }
 
 fn execute_insert_or_update(
     connection: &Connection,
     user_id: &str,
     config_json: &str,
 ) -> Result<(), rusqlite::Error> {
-    connection.execute(INSERT_OR_UPDATE_SQL, params![user_id, config_json])?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn query_user_config(
     connection: &Connection,
     user_id: &str,
 ) -> Result<String, UserConfigStoreError> {
     let config_json: Option<String> = connection
         .query_row(SELECT_CONFIG_SQL, params![user_id], |row| row.get(0))

---- v1::services::user_config_store::tests::test_helper_functions stdout ----

thread 'v1::services::user_config_store::tests::test_helper_functions' panicked at meow/src/v1/services/user_config_store.rs:365:61:
called `Result::unwrap()` on an `Err` value: NotFound

---- v1::services::user_config_store::tests::test_empty_config_json stdout ----

thread 'v1::services::user_config_store::tests::test_empty_config_json' panicked at meow/src/v1/services/user_config_store.rs:273:62:
called `Result::unwrap()` on an `Err` value: NotFound

---- v1::services::user_config_store::tests::test_config_exists stdout ----

thread 'v1::services::user_config_store::tests::test_config_exists' panicked at meow/src/v1/services/user_config_store.rs:262:9:
assertion `left == right` failed
  left: false
 right: true

failures:
    v1::services::user_config_store::tests::test_concurrent_access
    v1::services::user_config_store::tests::test_config_exists
    v1::services::user_config_store::tests::test_empty_config_json
    v1::services::user_config_store::tests::test_helper_functions
    v1::services::user_config_store::tests::test_insert_and_get_config
    v1::services::user_config_store::tests::test_large_config_json
    v1::services::user_config_store::tests::test_multiple_users
    v1::services::user_config_store::tests::test_special_characters_in_user_id
    v1::services::user_config_store::tests::test_sql_injection_safety
    v1::services::user_config_store::tests::test_update_existing_config
    v1::services::user_config_store::tests::test_very_long_user_id

test result: FAILED. 32 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
